app/views/favorites/index.html.erb

            <%= image_tag topic.image.url %>
            <% if !topic.favorite_users.include?(current_user) %>
---
SELECT  1 AS one FROM `users` INNER JOIN `favorites` ON `users`.`id` = `favorites`.`user_id` WHERE `favorites`.`topic_id` = 4 AND `users`.`id` = 1 LIMIT 1