app/views/topics/index.html.erb

            <%= image_tag topic.image.url %>
            <% if !topic.favorite_users.include?(current_user) %>
---
SELECT `favorites`.* FROM `favorites` WHERE `favorites`.`topic_id` IN (1, 2)