app/controllers/comments_controller.rb

INSERT INTO `comments` (`user_id`, `topic_id`, `content`, `created_at`, `updated_at`) VALUES (1, 1, 'aaaaaaaaaaaaaaaaaaaaaaaaaaaa', '2018-11-28 15:20:08', '2018-11-28 15:20:08')
---
  def create
    @comment = current_user.comments.new(comment_params)

    if @comment.save