app/controllers/favorites_controller.rb

  def create
    favorite = Favorite.new
    favorite.user_id = current_user.id
    favorite.topic_id = params[:topic_id]

    if favorite.save
---
INSERT INTO `favorites` (`user_id`, `topic_id`, `created_at`, `updated_at`) VALUES (3, 5, '2018-11-28 23:51:29', '2018-11-28 23:51:29')

  def destroy
    Favorite.find_by(topic_id: params[:topic_id], user_id: params[:user_id]).delete
---
DELETE FROM `favorites` WHERE `favorites`.`id` = 29
SELECT  `favorites`.* FROM `favorites` WHERE `favorites`.`topic_id` = 1 AND `favorites`.`user_id` = 4 LIMIT 1