app/controllers/topics_controller.rb

SELECT `topics`.* FROM `topics`
SELECT `users`.* FROM `users` WHERE `users`.`id` IN (1, 3)
SELECT `favorites`.* FROM `favorites` WHERE `favorites`.`topic_id` IN (1, 2)
SELECT `comments`.* FROM `comments` WHERE `comments`.`topic_id` = 1
---
  def index
    @topics = Topic.all.includes(:favorite_users)
    @favorites = Favorite.all
    @comments = Comment.all

INSERT INTO `topics` (`user_id`, `description`, `image`, `created_at`, `updated_at`) VALUES (1, 'qwerty', 'abstract-background-canvas-249798.jpg', '2018-11-28 15:16:11', '2018-11-28 15:16:11')
---
  def create
    @topic = current_user.topics.new(topic_params)

    if @topic.save